In [1]:
'''import kagglehub

# Download latest version
path = kagglehub.dataset_download("harshjaglan01/gold-price-prediction-with-time-series-analysis")

print("Path to dataset files:", path)'''

'import kagglehub\n\n# Download latest version\npath = kagglehub.dataset_download("harshjaglan01/gold-price-prediction-with-time-series-analysis")\n\nprint("Path to dataset files:", path)'

# Exploring dataset

In [20]:
import pandas as pd
df=pd.read_csv("Gold_price_(INR).csv")
df.head()

     Date   Price  Unnamed: 2  Unnamed: 3  Unnamed: 4  Unnamed: 5  Unnamed: 6
0  May-24  72,050         NaN         NaN         NaN         NaN         NaN
1  Apr-24  70,415         NaN         NaN         NaN         NaN         NaN
2  Mar-24  67,677         NaN         NaN         NaN         NaN         NaN
3  Feb-24  62,567         NaN         NaN         NaN         NaN         NaN
4  Jan-24  62,958         NaN         NaN         NaN         NaN         NaN

In [21]:
df.shape

(240, 7)

In [22]:
df=df[["Date","Price"]]

In [23]:
df.shape

(240, 2)

In [28]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 240 entries, 0 to 239
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Date    236 non-null    object
 1   Price   236 non-null    object
dtypes: object(2)
memory usage: 3.9+ KB

In [29]:
df.isnull().sum()

Date     4
Price    4
dtype: int64

In [24]:
df.head()

     Date   Price
0  May-24  72,050
1  Apr-24  70,415
2  Mar-24  67,677
3  Feb-24  62,567
4  Jan-24  62,958

In [25]:
df.tail()

       Date  Price
235  Oct-04  6,329
236     NaN    NaN
237     NaN    NaN
238     NaN    NaN
239     NaN    NaN

In [26]:
df=df.dropna()

In [27]:
df.shape

(236, 2)

# Fetching Data from YAHOO

In [31]:
#pip install yfinance pandas

In [32]:
import yfinance as yf
import pandas as pd

In [33]:
gold_ticker = 'GC=F'

# Fetch gold price data from October 2004 to today with monthly intervals
gold_data = yf.download(gold_ticker, start='2004-10-01', end=pd.Timestamp.today().strftime('%Y-%m-%d'), interval='1mo')

# Reset index to make 'Date' a column
gold_data.reset_index(inplace=True)

[*********************100%***********************]  1 of 1 completed

In [34]:
gold_data = gold_data[['Date', 'Open', 'High', 'Low', 'Close']]
gold_data.rename(columns={
    'Date': 'date',
    'Open': 'open_price',
    'High': 'high_price',
    'Low': 'low_price',
    'Close': 'close_price'
}, inplace=True)

In [35]:
print(gold_data.head())

Price        date  open_price  high_price   low_price close_price
Ticker                   GC=F        GC=F        GC=F        GC=F
0      2004-10-01  419.100006  430.000000  410.299988  428.500000
1      2004-11-01  427.299988  454.799988  424.600006  451.299988
2      2004-12-01  451.600006  456.500000  432.600006  437.500000
3      2005-01-01  431.000000  431.000000  418.700012  421.799988
4      2005-02-01  422.200012  436.000000  410.100006  436.500000

In [36]:
gold_data.to_csv('complete_gold_price_dataset.csv', index=False)
print("Complete gold price dataset saved as 'complete_gold_price_dataset.csv'.")

Complete gold price dataset saved as 'complete_gold_price_dataset.csv'.